.class public final L机蝱湦褱岣磃敝讟眤劦拽镚檾慀珼枹磊氬爜絩浢蹲逃丈類/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;
.super L堷拹麩鐢馠柪遣蝽蔤篸鑺钮瀭熗梡鶜池関嬳鹍廋龥潁熗鯌/蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;
.source "SourceFile"


# instance fields
.field public final synthetic 斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:L机蝱湦褱岣磃敝讟眤劦拽镚檾慀珼枹磊氬爜絩浢蹲逃丈類/蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;


# direct methods
.method public constructor <init>(L机蝱湦褱岣磃敝讟眤劦拽镚檾慀珼枹磊氬爜絩浢蹲逃丈類/蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;L堷拹麩鐢馠柪遣蝽蔤篸鑺钮瀭熗梡鶜池関嬳鹍廋龥潁熗鯌/氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵;)V
    .locals 0

    iput-object p1, p0, L机蝱湦褱岣磃敝讟眤劦拽镚檾慀珼枹磊氬爜絩浢蹲逃丈類/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:L机蝱湦褱岣磃敝讟眤劦拽镚檾慀珼枹磊氬爜絩浢蹲逃丈類/蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;

    invoke-direct {p0, p2}, L堷拹麩鐢馠柪遣蝽蔤篸鑺钮瀭熗梡鶜池関嬳鹍廋龥潁熗鯌/蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;-><init>(L堷拹麩鐢馠柪遣蝽蔤篸鑺钮瀭熗梡鶜池関嬳鹍廋龥潁熗鯌/氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵;)V

    return-void
.end method


# virtual methods
.method public final 淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷(Ljava/lang/String;Ljava/lang/String;)L堷拹麩鐢馠柪遣蝽蔤篸鑺钮瀭熗梡鶜池関嬳鹍廋龥潁熗鯌/遽嘁眼劔憂婄顽珲璓錾侯第釰浔麡炕墋炏扶苧粼咕駿勵茗;
    .locals 1

    new-instance v0, L机蝱湦褱岣磃敝讟眤劦拽镚檾慀珼枹磊氬爜絩浢蹲逃丈類/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;

    invoke-super {p0, p1, p2}, L堷拹麩鐢馠柪遣蝽蔤篸鑺钮瀭熗梡鶜池関嬳鹍廋龥潁熗鯌/遽嘁眼劔憂婄顽珲璓錾侯第釰浔麡炕墋炏扶苧粼咕駿勵茗;->淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷(Ljava/lang/String;Ljava/lang/String;)L堷拹麩鐢馠柪遣蝽蔤篸鑺钮瀭熗梡鶜池関嬳鹍廋龥潁熗鯌/遽嘁眼劔憂婄顽珲璓錾侯第釰浔麡炕墋炏扶苧粼咕駿勵茗;

    move-result-object p1

    invoke-direct {v0, p0, p1}, L机蝱湦褱岣磃敝讟眤劦拽镚檾慀珼枹磊氬爜絩浢蹲逃丈類/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;-><init>(L机蝱湦褱岣磃敝讟眤劦拽镚檾慀珼枹磊氬爜絩浢蹲逃丈類/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;L堷拹麩鐢馠柪遣蝽蔤篸鑺钮瀭熗梡鶜池関嬳鹍廋龥潁熗鯌/遽嘁眼劔憂婄顽珲璓錾侯第釰浔麡炕墋炏扶苧粼咕駿勵茗;)V

    return-object v0
.end method
