.class public final L狅贵堄侪肟蠧痛錃塔剸乣晵冕阭嫛潒熕俌螮檀萐澟酞辶侯/斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵;
.super L狅贵堄侪肟蠧痛錃塔剸乣晵冕阭嫛潒熕俌螮檀萐澟酞辶侯/斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;
.source "SourceFile"


# annotations
.annotation system Ldalvik/annotation/EnclosingClass;
    value = L狅贵堄侪肟蠧痛錃塔剸乣晵冕阭嫛潒熕俌螮檀萐澟酞辶侯/斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;
.end annotation

.annotation system Ldalvik/annotation/InnerClass;
    accessFlags = 0x9
    name = "\u6c2d\u6cc2\u798d\u7960\u80cf\u9759\u88dc\u708a\u7b5f\u538d\u6629\u7a66\u521c\u7c2c\u55a1\u6188\u78c3\u8c0c\u94ad\u5a32\u6116\u53a4\u9afc\u9da8\u8775"
.end annotation


# instance fields
.field public final 斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:Landroid/view/Choreographer;

.field public final 斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:L狅贵堄侪肟蠧痛錃塔剸乣晵冕阭嫛潒熕俌螮檀萐澟酞辶侯/斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;


# direct methods
.method public constructor <init>(L狅贵堄侪肟蠧痛錃塔剸乣晵冕阭嫛潒熕俌螮檀萐澟酞辶侯/斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;)V
    .locals 0

    invoke-direct {p0, p1}, L狅贵堄侪肟蠧痛錃塔剸乣晵冕阭嫛潒熕俌螮檀萐澟酞辶侯/斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;-><init>(L狅贵堄侪肟蠧痛錃塔剸乣晵冕阭嫛潒熕俌螮檀萐澟酞辶侯/斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;)V

    invoke-static {}, Landroid/view/Choreographer;->getInstance()Landroid/view/Choreographer;

    move-result-object p1

    iput-object p1, p0, L狅贵堄侪肟蠧痛錃塔剸乣晵冕阭嫛潒熕俌螮檀萐澟酞辶侯/斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:Landroid/view/Choreographer;

    new-instance p1, L狅贵堄侪肟蠧痛錃塔剸乣晵冕阭嫛潒熕俌螮檀萐澟酞辶侯/斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;

    invoke-direct {p1, p0}, L狅贵堄侪肟蠧痛錃塔剸乣晵冕阭嫛潒熕俌螮檀萐澟酞辶侯/斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;-><init>(L狅贵堄侪肟蠧痛錃塔剸乣晵冕阭嫛潒熕俌螮檀萐澟酞辶侯/斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵;)V

    iput-object p1, p0, L狅贵堄侪肟蠧痛錃塔剸乣晵冕阭嫛潒熕俌螮檀萐澟酞辶侯/斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:L狅贵堄侪肟蠧痛錃塔剸乣晵冕阭嫛潒熕俌螮檀萐澟酞辶侯/斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;

    return-void
.end method
