.class public final L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;
.super Ljava/lang/Object;
.source "SourceFile"

# interfaces
.implements Landroid/animation/ValueAnimator$AnimatorUpdateListener;


# annotations
.annotation system Ldalvik/annotation/EnclosingMethod;
    value = L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;->onApplyWindowInsets(Landroid/view/View;Landroid/view/WindowInsets;)Landroid/view/WindowInsets;
.end annotation

.annotation system Ldalvik/annotation/InnerClass;
    accessFlags = 0x1
    name = null
.end annotation


# instance fields
.field public final synthetic 斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:I

.field public final synthetic 斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:Landroid/view/View;

.field public final synthetic 斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡;

.field public final synthetic 斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪;

.field public final synthetic 淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷:L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡;


# direct methods
.method public constructor <init>(L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪;L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡;L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡;ILandroid/view/View;)V
    .locals 0

    iput-object p1, p0, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪;

    iput-object p2, p0, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡;

    iput-object p3, p0, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;->淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷:L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡;

    iput p4, p0, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:I

    iput-object p5, p0, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:Landroid/view/View;

    invoke-direct {p0}, Ljava/lang/Object;-><init>()V

    return-void
.end method


# virtual methods
.method public final onAnimationUpdate(Landroid/animation/ValueAnimator;)V
    .locals 14

    .line 1
    invoke-virtual {p1}, Landroid/animation/ValueAnimator;->getAnimatedFraction()F

    .line 2
    .line 3
    .line 4
    move-result p1

    .line 5
    iget-object v0, p0, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪;

    .line 6
    .line 7
    iget-object v1, v0, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪$遽嘁眼劔憂婄顽珲璓錾侯第釰浔麡炕墋炏扶苧粼咕駿勵茗;

    .line 8
    .line 9
    invoke-virtual {v1, p1}, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪$遽嘁眼劔憂婄顽珲璓錾侯第釰浔麡炕墋炏扶苧粼咕駿勵茗;->氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵(F)V

    .line 10
    .line 11
    .line 12
    iget-object p1, v0, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪$遽嘁眼劔憂婄顽珲璓錾侯第釰浔麡炕墋炏扶苧粼咕駿勵茗;

    .line 13
    .line 14
    invoke-virtual {p1}, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪$遽嘁眼劔憂婄顽珲璓錾侯第釰浔麡炕墋炏扶苧粼咕駿勵茗;->淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷()F

    .line 15
    .line 16
    .line 17
    move-result p1

    .line 18
    sget v1, Landroid/os/Build$VERSION;->SDK_INT:I

    .line 19
    .line 20
    const/16 v2, 0x1e

    .line 21
    .line 22
    iget-object v3, p0, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡;

    .line 23
    .line 24
    if-lt v1, v2, :cond_0

    .line 25
    .line 26
    new-instance v1, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡$氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵;

    .line 27
    .line 28
    invoke-direct {v1, v3}, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡$氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵;-><init>(L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡;)V

    .line 29
    .line 30
    .line 31
    goto :goto_0

    .line 32
    :cond_0
    const/16 v2, 0x1d

    .line 33
    .line 34
    if-lt v1, v2, :cond_1

    .line 35
    .line 36
    new-instance v1, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;

    .line 37
    .line 38
    invoke-direct {v1, v3}, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;-><init>(L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡;)V

    .line 39
    .line 40
    .line 41
    goto :goto_0

    .line 42
    :cond_1
    new-instance v1, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡$淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;

    .line 43
    .line 44
    invoke-direct {v1, v3}, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡$淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;-><init>(L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡;)V

    .line 45
    .line 46
    .line 47
    :goto_0
    const/4 v2, 0x1

    .line 48
    :goto_1
    const/16 v4, 0x100

    .line 49
    .line 50
    if-gt v2, v4, :cond_3

    .line 51
    .line 52
    iget v4, p0, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:I

    .line 53
    .line 54
    and-int/2addr v4, v2

    .line 55
    if-nez v4, :cond_2

    .line 56
    .line 57
    invoke-virtual {v3, v2}, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤(I)L脨皪悶軥濎隽設輴缼姝凜鮗镔豻匹匝晋竫怲生杺鈯蒿些搁/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;

    .line 58
    .line 59
    .line 60
    move-result-object v4

    .line 61
    goto :goto_2

    .line 62
    :cond_2
    invoke-virtual {v3, v2}, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤(I)L脨皪悶軥濎隽設輴缼姝凜鮗镔豻匹匝晋竫怲生杺鈯蒿些搁/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;

    .line 63
    .line 64
    .line 65
    move-result-object v4

    .line 66
    iget-object v5, p0, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;->淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷:L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡;

    .line 67
    .line 68
    invoke-virtual {v5, v2}, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤(I)L脨皪悶軥濎隽設輴缼姝凜鮗镔豻匹匝晋竫怲生杺鈯蒿些搁/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;

    .line 69
    .line 70
    .line 71
    move-result-object v5

    .line 72
    iget v6, v4, L脨皪悶軥濎隽設輴缼姝凜鮗镔豻匹匝晋竫怲生杺鈯蒿些搁/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:I

    .line 73
    .line 74
    iget v7, v5, L脨皪悶軥濎隽設輴缼姝凜鮗镔豻匹匝晋竫怲生杺鈯蒿些搁/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:I

    .line 75
    .line 76
    sub-int/2addr v6, v7

    .line 77
    int-to-float v6, v6

    .line 78
    const/high16 v7, 0x3f800000    # 1.0f

    .line 79
    .line 80
    sub-float/2addr v7, p1

    .line 81
    mul-float v6, v6, v7

    .line 82
    .line 83
    float-to-double v8, v6

    .line 84
    const-wide/high16 v10, 0x3fe0000000000000L    # 0.5

    .line 85
    .line 86
    add-double/2addr v8, v10

    .line 87
    double-to-int v6, v8

    .line 88
    iget v8, v4, L脨皪悶軥濎隽設輴缼姝凜鮗镔豻匹匝晋竫怲生杺鈯蒿些搁/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;->淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷:I

    .line 89
    .line 90
    iget v9, v5, L脨皪悶軥濎隽設輴缼姝凜鮗镔豻匹匝晋竫怲生杺鈯蒿些搁/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;->淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷:I

    .line 91
    .line 92
    sub-int/2addr v8, v9

    .line 93
    int-to-float v8, v8

    .line 94
    mul-float v8, v8, v7

    .line 95
    .line 96
    float-to-double v8, v8

    .line 97
    add-double/2addr v8, v10

    .line 98
    double-to-int v8, v8

    .line 99
    iget v9, v4, L脨皪悶軥濎隽設輴缼姝凜鮗镔豻匹匝晋竫怲生杺鈯蒿些搁/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;->蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕:I

    .line 100
    .line 101
    iget v12, v5, L脨皪悶軥濎隽設輴缼姝凜鮗镔豻匹匝晋竫怲生杺鈯蒿些搁/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;->蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕:I

    .line 102
    .line 103
    sub-int/2addr v9, v12

    .line 104
    int-to-float v9, v9

    .line 105
    mul-float v9, v9, v7

    .line 106
    .line 107
    float-to-double v12, v9

    .line 108
    add-double/2addr v12, v10

    .line 109
    double-to-int v9, v12

    .line 110
    iget v12, v4, L脨皪悶軥濎隽設輴缼姝凜鮗镔豻匹匝晋竫怲生杺鈯蒿些搁/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;->氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵:I

    .line 111
    .line 112
    iget v5, v5, L脨皪悶軥濎隽設輴缼姝凜鮗镔豻匹匝晋竫怲生杺鈯蒿些搁/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;->氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵:I

    .line 113
    .line 114
    sub-int/2addr v12, v5

    .line 115
    int-to-float v5, v12

    .line 116
    mul-float v5, v5, v7

    .line 117
    .line 118
    float-to-double v12, v5

    .line 119
    add-double/2addr v12, v10

    .line 120
    double-to-int v5, v12

    .line 121
    invoke-static {v4, v6, v8, v9, v5}, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡;->潂賁排隆缒仹蔌鲵盨櫌毋黴訪睴融夛痂罼冨冷檮飵怸浕囍(L脨皪悶軥濎隽設輴缼姝凜鮗镔豻匹匝晋竫怲生杺鈯蒿些搁/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;IIII)L脨皪悶軥濎隽設輴缼姝凜鮗镔豻匹匝晋竫怲生杺鈯蒿些搁/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;

    .line 122
    .line 123
    .line 124
    move-result-object v4

    .line 125
    :goto_2
    invoke-virtual {v1, v2, v4}, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡$遽嘁眼劔憂婄顽珲璓錾侯第釰浔麡炕墋炏扶苧粼咕駿勵茗;->蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕(IL脨皪悶軥濎隽設輴缼姝凜鮗镔豻匹匝晋竫怲生杺鈯蒿些搁/淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷;)V

    .line 126
    .line 127
    .line 128
    shl-int/lit8 v2, v2, 0x1

    .line 129
    .line 130
    goto :goto_1

    .line 131
    :cond_3
    invoke-virtual {v1}, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡$遽嘁眼劔憂婄顽珲璓錾侯第釰浔麡炕墋炏扶苧粼咕駿勵茗;->淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷()L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡;

    .line 132
    .line 133
    .line 134
    move-result-object p1

    .line 135
    invoke-static {v0}, Ljava/util/Collections;->singletonList(Ljava/lang/Object;)Ljava/util/List;

    .line 136
    .line 137
    .line 138
    move-result-object v0

    .line 139
    iget-object v1, p0, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤$斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:Landroid/view/View;

    .line 140
    .line 141
    invoke-static {v1, p1, v0}, L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/虡晐菸誁炽襻浑蠎荜餩鱇濼偷匬陃搝圩傶痙像縀曼镁悭豪$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;->梇纼趫湉钕籝铱禮趆尕監西熔緑栯哖灯箠蛳忚伓宍啳筿忙(Landroid/view/View;L眮獽嵨逥烪慟災挱晑遠袺髑孊永洸穛菨拫胂罊憣捺硬穘鸱/囋擩臯艿膳卦嬋澁魰煞尕揸軇霭壤賲玭圾镎嬧駓孎唚绣鍡;Ljava/util/List;)V

    .line 142
    .line 143
    .line 144
    return-void
    .line 145
    .line 146
    .line 147
    .line 148
    .line 149
    .line 150
    .line 151
    .line 152
    .line 153
    .line 154
    .line 155
    .line 156
    .line 157
    .line 158
    .line 159
    .line 160
    .line 161
    .line 162
    .line 163
    .line 164
    .line 165
    .line 166
    .line 167
.end method
