.class public final L輊夕織迺笊舽悶嚄斵鮁姆池嫫罄熻祦哼攊趼卺糢瞶馩炜珥/読苂釬丽透鎋嬓鋙燩准瘒名睞癆芉賓憞晢隞腅鄀谄鄾麶劾$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;
.super Ljava/lang/Object;
.source "SourceFile"


# annotations
.annotation system Ldalvik/annotation/EnclosingClass;
    value = L輊夕織迺笊舽悶嚄斵鮁姆池嫫罄熻祦哼攊趼卺糢瞶馩炜珥/読苂釬丽透鎋嬓鋙燩准瘒名睞癆芉賓憞晢隞腅鄀谄鄾麶劾;
.end annotation

.annotation system Ldalvik/annotation/InnerClass;
    accessFlags = 0x9
    name = "\u8633\u9161\u7f76\u5934\u98e5\u5ac0\u9e21\u500c\u5264\u9b7b\u5301\u70db\u5c73\u7cb2\u5802\u54a0\u76f4\u5003\u9e89\u9e70\u9ad6\u9e16\u627c\u80e3\u6795"
.end annotation


# instance fields
.field public 斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:I

.field public 氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵:I

.field public final 淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷:I

.field public 蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕:I


# direct methods
.method public constructor <init>(IIII)V
    .locals 0

    invoke-direct {p0}, Ljava/lang/Object;-><init>()V

    iput p1, p0, L輊夕織迺笊舽悶嚄斵鮁姆池嫫罄熻祦哼攊趼卺糢瞶馩炜珥/読苂釬丽透鎋嬓鋙燩准瘒名睞癆芉賓憞晢隞腅鄀谄鄾麶劾$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:I

    iput p2, p0, L輊夕織迺笊舽悶嚄斵鮁姆池嫫罄熻祦哼攊趼卺糢瞶馩炜珥/読苂釬丽透鎋嬓鋙燩准瘒名睞癆芉賓憞晢隞腅鄀谄鄾麶劾$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;->淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷:I

    iput p3, p0, L輊夕織迺笊舽悶嚄斵鮁姆池嫫罄熻祦哼攊趼卺糢瞶馩炜珥/読苂釬丽透鎋嬓鋙燩准瘒名睞癆芉賓憞晢隞腅鄀谄鄾麶劾$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;->蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕:I

    iput p4, p0, L輊夕織迺笊舽悶嚄斵鮁姆池嫫罄熻祦哼攊趼卺糢瞶馩炜珥/読苂釬丽透鎋嬓鋙燩准瘒名睞癆芉賓憞晢隞腅鄀谄鄾麶劾$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;->氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵:I

    return-void
.end method

.method public constructor <init>(L輊夕織迺笊舽悶嚄斵鮁姆池嫫罄熻祦哼攊趼卺糢瞶馩炜珥/読苂釬丽透鎋嬓鋙燩准瘒名睞癆芉賓憞晢隞腅鄀谄鄾麶劾$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;)V
    .locals 1

    invoke-direct {p0}, Ljava/lang/Object;-><init>()V

    iget v0, p1, L輊夕織迺笊舽悶嚄斵鮁姆池嫫罄熻祦哼攊趼卺糢瞶馩炜珥/読苂釬丽透鎋嬓鋙燩准瘒名睞癆芉賓憞晢隞腅鄀谄鄾麶劾$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:I

    iput v0, p0, L輊夕織迺笊舽悶嚄斵鮁姆池嫫罄熻祦哼攊趼卺糢瞶馩炜珥/読苂釬丽透鎋嬓鋙燩准瘒名睞癆芉賓憞晢隞腅鄀谄鄾麶劾$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:I

    iget v0, p1, L輊夕織迺笊舽悶嚄斵鮁姆池嫫罄熻祦哼攊趼卺糢瞶馩炜珥/読苂釬丽透鎋嬓鋙燩准瘒名睞癆芉賓憞晢隞腅鄀谄鄾麶劾$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;->淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷:I

    iput v0, p0, L輊夕織迺笊舽悶嚄斵鮁姆池嫫罄熻祦哼攊趼卺糢瞶馩炜珥/読苂釬丽透鎋嬓鋙燩准瘒名睞癆芉賓憞晢隞腅鄀谄鄾麶劾$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;->淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷:I

    iget v0, p1, L輊夕織迺笊舽悶嚄斵鮁姆池嫫罄熻祦哼攊趼卺糢瞶馩炜珥/読苂釬丽透鎋嬓鋙燩准瘒名睞癆芉賓憞晢隞腅鄀谄鄾麶劾$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;->蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕:I

    iput v0, p0, L輊夕織迺笊舽悶嚄斵鮁姆池嫫罄熻祦哼攊趼卺糢瞶馩炜珥/読苂釬丽透鎋嬓鋙燩准瘒名睞癆芉賓憞晢隞腅鄀谄鄾麶劾$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;->蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕:I

    iget p1, p1, L輊夕織迺笊舽悶嚄斵鮁姆池嫫罄熻祦哼攊趼卺糢瞶馩炜珥/読苂釬丽透鎋嬓鋙燩准瘒名睞癆芉賓憞晢隞腅鄀谄鄾麶劾$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;->氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵:I

    iput p1, p0, L輊夕織迺笊舽悶嚄斵鮁姆池嫫罄熻祦哼攊趼卺糢瞶馩炜珥/読苂釬丽透鎋嬓鋙燩准瘒名睞癆芉賓憞晢隞腅鄀谄鄾麶劾$蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;->氭泂禍祠胏静補炊筟厍昩穦刜簬喡憈磃谌钭娲愖厤髼鶨蝵:I

    return-void
.end method
