.class public final L鋙軫冯暄鹃鈡隚鞂鰕窊讨匚趂司鿒悪鄛尵踻駟蕓闽悹堊炞/炘鶦抐茻诺鑕其抔盾踖濜訇鳋崱肦訲鸤鲗綇泸後勅迷綖槧;
.super L狅贵堄侪肟蠧痛錃塔剸乣晵冕阭嫛潒熕俌螮檀萐澟酞辶侯/蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;
.source "SourceFile"


# instance fields
.field public 斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:I

.field public 斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:J

.field public 淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷:J

.field public 蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕:J


# direct methods
.method public constructor <init>()V
    .locals 2

    invoke-direct {p0}, L狅贵堄侪肟蠧痛錃塔剸乣晵冕阭嫛潒熕俌螮檀萐澟酞辶侯/蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕;-><init>()V

    const-wide/16 v0, -0x1

    iput-wide v0, p0, L鋙軫冯暄鹃鈡隚鞂鰕窊讨匚趂司鿒悪鄛尵踻駟蕓闽悹堊炞/炘鶦抐茻诺鑕其抔盾踖濜訇鳋崱肦訲鸤鲗綇泸後勅迷綖槧;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:J

    iput-wide v0, p0, L鋙軫冯暄鹃鈡隚鞂鰕窊讨匚趂司鿒悪鄛尵踻駟蕓闽悹堊炞/炘鶦抐茻诺鑕其抔盾踖濜訇鳋崱肦訲鸤鲗綇泸後勅迷綖槧;->淤宑椝椔璲鲓禴墔慈杮潚伻缯焽莴澫賣芩餝逗汵顆癆鮆豷:J

    iput-wide v0, p0, L鋙軫冯暄鹃鈡隚鞂鰕窊讨匚趂司鿒悪鄛尵踻駟蕓闽悹堊炞/炘鶦抐茻诺鑕其抔盾踖濜訇鳋崱肦訲鸤鲗綇泸後勅迷綖槧;->蘳酡罶头飥嫀鸡倌剤魻匁烛屳粲堂咠直倃麉鹰髖鸖扼胣枕:J

    const/4 v0, -0x1

    iput v0, p0, L鋙軫冯暄鹃鈡隚鞂鰕窊讨匚趂司鿒悪鄛尵踻駟蕓闽悹堊炞/炘鶦抐茻诺鑕其抔盾踖濜訇鳋崱肦訲鸤鲗綇泸後勅迷綖槧;->斢衔鬹愠狱堪钓骖禞吳郀沜跲褼弦硠餓軓刧篖憯秃弳垜撤:I

    return-void
.end method
